//שקע חשמל הוא אינטרפייס (ממשק). הוא לא מייצר חשמל בעצמו, והוא לא יודע מה אתה הולך לחבר אליו. אבל השקע מציב חוזה (חוקים) ברור: "מי שרוצה לקבל ממני חשמל, חייב שיהיה לו תקע עם שני פינים בגודל ובמרחק המדויק הזה". חברות מיצרות מכשירי חשמל שומים לחלוטין אבל בסופו של דבר כולם ממשים את הממשק
//אינטרפייס הוא בעצם רשימת דרישות (פעולות) ריקות, בלי שום תוכן ובלי תכונות. הוא רק אומר מה המחלקות צריכות לעשות, לא איך הן יעשו את זה.
public interface Activities{
    //int AGE=1;
    String NAME="name";
    /*public abstract */void poop();//בinterface לא צריך להשתמש בabstract כי כל פעולה\שדה בinterface נחשבת למופשטת אותו הדבר לגבי PUBLIC
    // ההבדל העיקרי בין מחלקה מופשטת לINTERFACE היא:
    //1. מחלקה יכולה לרשת רק מחלקה אחת אז אם היא מופשטת אפשר רק אחד, לעומת זאת בINTERFACE אפשר כמה שרוצים
    //2.כל שדה שרושמים בINTERFACE יהיה סטטי וסופי(STATIC,FINAL) בגלל שכל שדה בINTERFACE הוא סטטי זה אומר שגם לכל השדות במחלקות שלוקחות מפה יהיו אותו דבר.
    //3. מחלקה מופשטת מגדירה את הזהות של המחלקה(מי זה, בן כמה,גובה, משקל וכו') ממשק מגדיר מה הוא יודע לעשות(לעשות קקי, לאכול, לשתות וכו')
    //4. בממשק אין בנאים
    //5. בממשק כל הפעולות הם בלי גוף{} והם פומביות תמיד, במופשטות אפשר גם וגם אפשר איזה גישה שרוצים וגם הפעולה לא חייבת להיות ריקה


}
